benchmarks/vllm/runpod_h100sxm/Qwen3-32B/qwen3_32b_TP8_DP1_in2048_out128_p500_c50_f57c67.txt
BENCHMARK: qwen3_32b_TP8_DP1_in2048_out128_p500_c50_f57c67
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7730a21a0ea0>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=2048, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=50, model='/root/models/Qwen3-32B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./benchmarks/vllm/runpod_h100sxm/Qwen3-32B', result_filename='qwen3_32b_TP8_DP1_in2048_out128_p500_c50_f57c67.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-6b3ad5c6-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 04-10 10:30:04 [datasets.py:612] Sampling input_len from [2048, 2048] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 50

  0%|          | 0/500 [00:00<?, ?it/s]
  0%|          | 1/500 [00:03<26:58,  3.24s/it]
  0%|          | 2/500 [00:03<12:00,  1.45s/it]
  8%|▊         | 41/500 [00:03<00:21, 21.36it/s]
 11%|█         | 53/500 [00:06<00:49,  8.99it/s]
 16%|█▌        | 81/500 [00:06<00:24, 17.09it/s]
 18%|█▊        | 92/500 [00:07<00:20, 20.35it/s]
 20%|██        | 102/500 [00:10<00:41,  9.59it/s]
 27%|██▋       | 135/500 [00:10<00:19, 18.66it/s]
 29%|██▉       | 146/500 [00:10<00:16, 21.65it/s]
 31%|███       | 156/500 [00:13<00:33, 10.24it/s]
 37%|███▋      | 185/500 [00:13<00:17, 18.07it/s]
 39%|███▉      | 196/500 [00:13<00:14, 21.06it/s]
 41%|████      | 206/500 [00:16<00:29, 10.07it/s]
 46%|████▌     | 231/500 [00:16<00:16, 16.77it/s]
 48%|████▊     | 242/500 [00:17<00:13, 19.82it/s]
 50%|█████     | 252/500 [00:20<00:25,  9.66it/s]
 57%|█████▋    | 285/500 [00:20<00:11, 18.50it/s]
 59%|█████▉    | 296/500 [00:20<00:09, 21.45it/s]
 61%|██████    | 306/500 [00:23<00:18, 10.25it/s]
 67%|██████▋   | 335/500 [00:23<00:09, 18.02it/s]
 69%|██████▉   | 346/500 [00:23<00:07, 20.98it/s]
 71%|███████   | 356/500 [00:26<00:14, 10.07it/s]
 77%|███████▋  | 385/500 [00:26<00:06, 17.83it/s]
 79%|███████▉  | 396/500 [00:26<00:04, 20.81it/s]
 81%|████████  | 406/500 [00:29<00:09, 10.00it/s]
 87%|████████▋ | 435/500 [00:30<00:03, 17.76it/s]
 89%|████████▉ | 446/500 [00:30<00:02, 20.73it/s]
 91%|█████████ | 456/500 [00:33<00:04, 10.08it/s]
100%|██████████| 500/500 [00:33<00:00, 14.99it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             50        
Benchmark duration (s):                  33.36     
Total input tokens:                      1024000   
Total generated tokens:                  64000     
Request throughput (req/s):              14.99     
Output token throughput (tok/s):         1918.49   
Peak output token throughput (tok/s):    4794.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          32614.31  
---------------Time to First Token----------------
Mean TTFT (ms):                          1088.11   
Median TTFT (ms):                        1104.54   
P99 TTFT (ms):                           2169.12   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          17.65     
Median TPOT (ms):                        17.45     
P99 TPOT (ms):                           25.06     
---------------Inter-token Latency----------------
Mean ITL (ms):                           17.65     
Median ITL (ms):                         10.04     
P99 ITL (ms):                            167.18    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          3329.13   
Median E2EL (ms):                        3320.05   
P99 E2EL (ms):                           3638.87   
==================================================